import React from 'react';
import { Footer, Header } from '../components';

const About: React.FC = () => {
  window.scrollTo(0, 0);

  return (
    <>
      <Header />
      <section className="about">
        <div className="container">
          <div className="about__text">
            <h2 className="about__label">
              СТАВАЙ КРАЩЕ <br /> З КОЖНИМ ДНЕМ
            </h2>
            <h3 className="about__sublabel">
              – це слоган, який є синонімом бренду YANKI. <br /> Ми любимо свою справу
            </h3>
            <h4 className="about__bottom">З ПОВАГОЮ, КОМАНДА #YANKICLOTHES</h4>
          </div>
          <div className="about__info">
            <div className="about__info-text">
              Історія компанії Yanki почалася у 2013 році. Засновники — енергійні та креативні
              хлопці, брати з невеликого міста в західній частині України, — вирішили спрямувати
              свою діяльність на розвиток українського одягу. Восени того ж року першим релізом була
              випущена парка під назвою Yanki. Вона стала першою ластівкою у широкому асортименті
              моделей компанії, розроблених і втілених у життя. Українці підтримали молодіжний бренд
              і вітали появу новинок. У 2015 році колекції бренду Yanki включали в себе верхній
              одяг. Кредо компанії - постійний рух вперед. З кожним релізом ми ставимо перед собою
              нові завдання і працюємо на максимальний результат.
            </div>
            <div className="about__info-text">
              Обираючи Yanki, ви перш за все отримуєте якість за доступну ціну. Ми цінуємо кожного з
              наших покупців, пишаємося великою кількістю позитивних відгуків. Технології розробки
              та випуску продукції безперервно вдосконалюються - наші клієнти заслуговують лише
              найкращого. Здійснюємо суворий контроль виробництва і підбору тканин для нового одягу.
              Над розвитком українського бренду одягу потужно працює команда талановитих і
              компетентних молодих людей, ентузіастів своєї справи. Офіційні магазини Yanki
              знаходяться в багатьох містах України і їх перелік постійно розширюється. У березні
              2018 вперше ми випустили жіночу колекцію, яка стала черговим підтвердженням того, що
              постійний розвиток - головна риса компанії.
            </div>
          </div>
        </div>
      </section>
      <Footer />
    </>
  );
};

export default About;
