import React from 'react';
import { Footer, Header } from '../components';

const Refund: React.FC = () => {
  window.scrollTo(0, 0);

  return (
    <>
      <Header />
      <section className="refund">
        <div className="container">
          <h1 className="refund__title">Обмін та повернення</h1>
          <p className="refund__label">
            Якщо вам не підійшло замовлення, ми із задоволенням його обміняємо або приймемо
            повернення
          </p>
          <p className="refund__terms">Обмін та повернення можливий у випадку:</p>
          <div className="refund__row">
            <div className="refund__column">
              <div className="refund__img">
                <svg
                  width="30"
                  height="30"
                  viewBox="0 0 30 30"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg">
                  <path
                    d="M13.6816 0L27.9591 2.04089L29.9986 16.3199L16.7407 29.5777C16.4703 29.8481 16.1035 30 15.721 30C15.3386 30 14.9718 29.8481 14.7013 29.5777L0.422293 15.2987C0.151899 15.0282 0 14.6614 0 14.279C0 13.8965 0.151899 13.5297 0.422293 13.2593L13.6816 0ZM17.7605 12.2395C18.0284 12.5074 18.3464 12.7198 18.6964 12.8647C19.0464 13.0096 19.4216 13.0842 19.8004 13.0841C20.1792 13.084 20.5543 13.0094 20.9043 12.8643C21.2543 12.7193 21.5722 12.5067 21.8401 12.2388C22.1079 11.9709 22.3203 11.6529 22.4652 11.3028C22.6101 10.9528 22.6847 10.5777 22.6846 10.1989C22.6845 9.82005 22.6099 9.44494 22.4648 9.09498C22.3198 8.74501 22.1073 8.42704 21.8393 8.15922C21.5714 7.8914 21.2534 7.67896 20.9034 7.53406C20.5533 7.38915 20.1782 7.3146 19.7994 7.31467C19.0343 7.3148 18.3006 7.61885 17.7597 8.15994C17.2188 8.70103 16.915 9.43482 16.9152 10.1999C16.9153 10.965 17.2194 11.6987 17.7605 12.2395Z"
                    fill="#E0BEA2"
                  />
                </svg>
              </div>
              <div className="refund__description">
                якщо замовлення не було використане та зберегло товарний вигляд (у тому числі не
                порушені бірки, ярлики, пакувальні матеріали)
              </div>
            </div>
            <div className="refund__column">
              <div className="refund__img">
                <svg
                  width="30"
                  height="30"
                  viewBox="0 0 30 30"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg">
                  <path
                    d="M15 30C6.7155 30 0 23.2845 0 15C0 6.7155 6.7155 0 15 0C23.2845 0 30 6.7155 30 15C30 23.2845 23.2845 30 15 30ZM16.5 15V7.5H13.5V18H22.5V15H16.5Z"
                    fill="#E0BEA2"
                  />
                </svg>
              </div>
              <div className="refund__description">
                повернення та обмін здійснюється протягом двох днів з моменту отримання замовлення
              </div>
            </div>
            <div className="refund__column">
              <div className="refund__img">
                <svg
                  width="30"
                  height="30"
                  viewBox="0 0 30 30"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg">
                  <path
                    d="M20 0C20.789 0 21.4286 0.639593 21.4286 1.42857V2.85571L28.5714 2.85714V11.4286L25.6857 11.4271L29.6382 22.2789C29.8721 22.9029 30 23.5787 30 24.2843C30 27.4402 27.4416 29.9986 24.2857 29.9986C21.624 29.9986 19.3873 28.1787 18.7521 25.7154L12.6768 25.7154C12.0421 28.1794 9.80509 30 7.14286 30C4.36447 30 2.04922 28.0171 1.53505 25.3893C0.622251 24.9129 0 23.9577 0 22.8571V15.7143H12.8571C12.8571 16.4469 13.4086 17.0507 14.1191 17.1332L14.2857 17.1429H17.1429C17.8755 17.1429 18.4793 16.5914 18.5618 15.8809L18.5714 15.7143V2.85714H14.2857V0H20ZM7.14286 21.4286C5.5649 21.4286 4.28571 22.7078 4.28571 24.2857C4.28571 25.8637 5.5649 27.1429 7.14286 27.1429C8.72081 27.1429 10 25.8637 10 24.2857C10 22.7078 8.72081 21.4286 7.14286 21.4286ZM24.2857 21.4286C22.7078 21.4286 21.4286 22.7078 21.4286 24.2857C21.4286 25.8637 22.7078 27.1429 24.2857 27.1429C25.8637 27.1429 27.1429 25.8637 27.1429 24.2857C27.1429 22.7078 25.8637 21.4286 24.2857 21.4286ZM11.4286 2.85714C12.2176 2.85714 12.8571 3.49674 12.8571 4.28571V14.2857H0V4.28571C0 3.49674 0.639593 2.85714 1.42857 2.85714H11.4286ZM25.7143 5.71429H21.4286V8.57143H25.7143V5.71429ZM10 5.71429H2.85714V7.14286H10V5.71429Z"
                    fill="#E0BEA2"
                  />
                </svg>
              </div>
              <div className="refund__description">
                повернення та обмін товару можливе лише при відправленні по Україні
              </div>
            </div>
            <div className="refund__column">
              <div className="refund__img">
                <svg
                  width="28"
                  height="30"
                  viewBox="0 0 28 30"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg">
                  <path
                    d="M26 30H2C1.60218 30 1.22064 29.842 0.93934 29.5607C0.658035 29.2794 0.5 28.8978 0.5 28.5V1.5C0.5 1.10218 0.658035 0.720644 0.93934 0.43934C1.22064 0.158035 1.60218 0 2 0H26C26.3978 0 26.7794 0.158035 27.0607 0.43934C27.342 0.720644 27.5 1.10218 27.5 1.5V28.5C27.5 28.8978 27.342 29.2794 27.0607 29.5607C26.7794 29.842 26.3978 30 26 30ZM8 7.5V10.5H20V7.5H8ZM8 13.5V16.5H20V13.5H8ZM8 19.5V22.5H15.5V19.5H8Z"
                    fill="#E0BEA2"
                  />
                </svg>
              </div>
              <div className="refund__description">бланк повернення присутній у кожній посилці</div>
            </div>
            <div className="refund__column">
              <div className="refund__img">
                <svg
                  width="30"
                  height="30"
                  viewBox="0 0 30 30"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg">
                  <path
                    d="M15 30C6.7155 30 0 23.2845 0 15C0 6.7155 6.7155 0 15 0C23.2845 0 30 6.7155 30 15C30 23.2845 23.2845 30 15 30ZM9.75 18V21H13.5V24H16.5V21H18C18.9946 21 19.9484 20.6049 20.6516 19.9016C21.3549 19.1984 21.75 18.2446 21.75 17.25C21.75 16.2554 21.3549 15.3016 20.6516 14.5983C19.9484 13.8951 18.9946 13.5 18 13.5H12C11.8011 13.5 11.6103 13.421 11.4697 13.2803C11.329 13.1397 11.25 12.9489 11.25 12.75C11.25 12.5511 11.329 12.3603 11.4697 12.2197C11.6103 12.079 11.8011 12 12 12H20.25V9H16.5V6H13.5V9H12C11.0054 9 10.0516 9.39509 9.34835 10.0983C8.64509 10.8016 8.25 11.7554 8.25 12.75C8.25 13.7446 8.64509 14.6984 9.34835 15.4017C10.0516 16.1049 11.0054 16.5 12 16.5H18C18.1989 16.5 18.3897 16.579 18.5303 16.7197C18.671 16.8603 18.75 17.0511 18.75 17.25C18.75 17.4489 18.671 17.6397 18.5303 17.7803C18.3897 17.921 18.1989 18 18 18H9.75Z"
                    fill="#E0BEA2"
                  />
                </svg>
              </div>
              <div className="refund__description">
                всі витрати на обмін та повернення товару несе покупець
              </div>
            </div>
            <div className="refund__column">
              <div className="refund__img">
                <svg
                  width="30"
                  height="24"
                  viewBox="0 0 30 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg">
                  <path
                    d="M30 9.33333V22.6667C30 23.0203 29.842 23.3594 29.5607 23.6095C29.2794 23.8595 28.8978 24 28.5 24H1.5C1.10218 24 0.720644 23.8595 0.43934 23.6095C0.158035 23.3594 0 23.0203 0 22.6667V9.33333H30ZM30 6.66667H0V1.33333C0 0.979711 0.158035 0.640573 0.43934 0.390524C0.720644 0.140476 1.10218 0 1.5 0H28.5C28.8978 0 29.2794 0.140476 29.5607 0.390524C29.842 0.640573 30 0.979711 30 1.33333V6.66667ZM19.5 17.3333V20H25.5V17.3333H19.5Z"
                    fill="#E0BEA2"
                  />
                </svg>
              </div>
              <div className="refund__description">
                після отримання повернення ми робимо переказ коштів на картку клієнта
              </div>
            </div>
          </div>
        </div>
      </section>
      <Footer />
    </>
  );
};

export default Refund;
